app/controllers/cars_controller.rb

SELECT "parts".* FROM "parts"
---
  def new
    @car = Car.new
    @parts = Part.all

SELECT "parts".* FROM "parts" WHERE "parts"."id" IN (?, ?, ?)  [["id", 4], ["id", 5], ["id", 6]]
INSERT INTO "cars" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Tar"], ["created_at", "2023-02-02 07:45:47.952934"], ["updated_at", "2023-02-02 07:45:47.952934"]]
INSERT INTO "cars" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "r"], ["created_at", "2023-02-02 07:48:29.224678"], ["updated_at", "2023-02-02 07:48:29.224678"]]
INSERT INTO "cars_parts" ("car_id", "part_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["car_id", 17], ["part_id", 4], ["created_at", "2023-02-02 08:44:41.370770"], ["updated_at", "2023-02-02 08:44:41.370770"]]
---
  def create
    @car = Car.new(car_params)
    @parts = Part.find(params[:part])
    if @car.save
      @car.parts << @parts

SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
SELECT "parts".* FROM "parts"
---
  def edit
    @car = Car.find(params[:id])
    @parts = Part.all

SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
SELECT "parts".* FROM "parts" WHERE "parts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "cars" WHERE "cars"."id" = ?  [["id", 14]]
DELETE FROM "cars_parts" WHERE "cars_parts"."car_id" = ? AND "cars_parts"."part_id" IN (?, ?, ?)  [["car_id", 16], ["part_id", 3], ["part_id", 5], ["part_id", 6]]
UPDATE "cars" SET "updated_at" = ? WHERE "cars"."id" = ?  [["updated_at", "2023-02-08 12:44:54.526209"], ["id", 20]]
INSERT INTO "cars_parts" ("car_id", "part_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["car_id", 1], ["part_id", 4], ["created_at", "2023-02-02 10:04:33.776100"], ["updated_at", "2023-02-02 10:04:33.776100"]]
---
  def update
    @car = Car.find(params[:id])
    @parts = Part.find(params[:part])
    @car.parts.clear
    if @car.update(car_params)
      @car.parts << @parts

SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
DELETE FROM "cars" WHERE "cars"."id" = ?  [["id", 17]]
---
  def destroy
    @car = Car.find(params[:id])
    @car.destroy