app/views/cars/edit.html.erb

      <% @parts.each do |p| %>
         <%= check_box_tag("part[]", p.id, @car.parts.exists?(p.id) ) %>
---
SELECT "parts"."id" FROM "parts" INNER JOIN "cars_parts" ON "parts"."id" = "cars_parts"."part_id" WHERE "cars_parts"."car_id" = ?  [["car_id", 19]]
SELECT 1 AS one FROM "parts" INNER JOIN "cars_parts" ON "parts"."id" = "cars_parts"."part_id" WHERE "cars_parts"."car_id" = ? AND "parts"."id" = ? LIMIT ?  [["car_id", 19], ["id", 1], ["LIMIT", 1]]