app/views/cars/index.html.erb

SELECT "parts".* FROM "parts" INNER JOIN "cars_parts" ON "parts"."id" = "cars_parts"."part_id" WHERE "cars_parts"."car_id" = ?  [["car_id", 1]]
---
         <td><%= button_to :Delete, car_path(a),method: :delete %></td>
         <td><% a.parts.each do |p| %>