app/views/cars/show.html.erb

SELECT "parts".* FROM "parts" INNER JOIN "cars_parts" ON "parts"."id" = "cars_parts"."part_id" WHERE "cars_parts"."car_id" = ?  [["car_id", 7]]
---
      </tr>
         <% @car.parts.each do |p| %>